tp1/app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)
        if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "img") VALUES (?, ?, ?, ?, ?)  [["title", "Test w img"], ["text", "Add an image ?"], ["created_at", "2017-11-14 17:23:22.893375"], ["updated_at", "2017-11-14 17:23:22.893375"], ["img", ""]]

    def index
        @articles = Article.all
        @articles = Article.all.paginate(page: params[:page], per_page: 4)
---
SELECT  "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"